In [1]:
import pandas as pd
drinks = pd.read_csv('./data/drinksbycountry', index_col = 'country')
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [2]:
# loc accesses by label
drinks.loc['China', :]

beer_servings                     79
spirit_servings                  192
wine_servings                      8
total_litres_of_pure_alcohol       5
continent                       Asia
Name: China, dtype: object

In [3]:
# iloc accesses by position
drinks.iloc[2,:]

beer_servings                       25
spirit_servings                      0
wine_servings                       14
total_litres_of_pure_alcohol       0.7
continent                       Africa
Name: Algeria, dtype: object

In [4]:
# alternative: use loc
drinks.loc['China', drinks.columns[1]]

192

In [5]:
drinks.index.get_loc('China')

36

In [6]:
# alternative: use iloc
drinks.iloc[drinks.index.get_loc('China'), :]

beer_servings                     79
spirit_servings                  192
wine_servings                      8
total_litres_of_pure_alcohol       5
continent                       Asia
Name: China, dtype: object

In [7]:
# alternative: use iloc
drinks.iloc[36, drinks.columns.get_loc('wine_servings')]

8

### MultiIndex

In [8]:
import numpy as np
import pandas as pd 
se1 = pd.Series(np.random.randn(4), index = [list("aabb"), [1,2,1,2]])
se1

a  1   -0.167280
   2    0.487645
b  1    1.466580
   2    0.769153
dtype: float64

In [9]:
se1['a']

1   -0.167280
2    0.487645
dtype: float64

In [10]:
se1['a': 'b']

a  1   -0.167280
   2    0.487645
b  1    1.466580
   2    0.769153
dtype: float64

In [11]:
se1[:, 1]

a   -0.16728
b    1.46658
dtype: float64

In [12]:
df1=pd.DataFrame(np.arange(12).reshape(4,3),index=[list("AABB"),[1,2,1,2]],columns=[list("XXY"),[10,11,10]])
df1

     X       Y
    10  11  10
A 1  0   1   2
  2  3   4   5
B 1  6   7   8
  2  9  10  11

In [13]:
df1.columns.names = ['XY', 'sum']
df1.index.names = ['AB', 'num']
df1

XY      X       Y
sum    10  11  10
AB num
A  1    0   1   2
   2    3   4   5
B  1    6   7   8
   2    9  10  11

https://blog.csdn.net/weixin_38168620/article/details/80071141?ops_request_misc=%257B%2522request%255Fid%2522%253A%2522159194828819195162516000%2522%252C%2522scm%2522%253A%252220140713.130102334..%2522%257D&request_id=159194828819195162516000&biz_id=0&utm_medium=distribute.pc_search_result.none-task-blog-2~all~sobaiduend~default-1-80071141.first_rank_ecpm_v3_pc_rank_v2&utm_term=pandas+multiindex

https://www.youtube.com/watch?v=tcRGa2soc-c

In [15]:
stocks = pd.read_csv('./data/smallstocks.csv')
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [16]:
stocks.dtypes

Date       object
Close     float64
Volume      int64
Symbol     object
dtype: object

In [17]:
stocks.index

RangeIndex(start=0, stop=9, step=1)

In [18]:
stocks.groupby('Symbol').Close.mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [21]:
ser = stocks.groupby(['Symbol', 'Date']).Close.mean()
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [23]:
ser.index

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

In [24]:
ser.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [26]:
df = stocks.pivot_table(values = 'Close', 
                   index = 'Symbol',
                   columns = 'Date')
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [42]:
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [43]:
ser.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [44]:
ser.loc['AAPL', '2016-10-03']

112.52

In [45]:
ser.loc[:, '2016-10-03']

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: Close, dtype: float64

In [46]:
df = ser.unstack()
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [47]:
df.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: AAPL, dtype: float64

In [48]:
df.loc['AAPL', '2016-10-03']

112.52

In [50]:
df.loc[: ,'2016-10-03']

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: 2016-10-03, dtype: float64

In [51]:
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [52]:
stocks.set_index(['Symbol', 'Date'], inplace = True)
stocks

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [53]:
stocks.index

MultiIndex([('CSCO', '2016-10-03'),
            ('AAPL', '2016-10-03'),
            ('MSFT', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('MSFT', '2016-10-04'),
            ('CSCO', '2016-10-04'),
            ('MSFT', '2016-10-05'),
            ('CSCO', '2016-10-05'),
            ('AAPL', '2016-10-05')],
           names=['Symbol', 'Date'])

In [54]:
stocks.sort_index(inplace = True)
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [55]:
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

In [58]:
stocks.loc[('AAPL', '2016-10-03'), :]

Close          112.52
Volume    21701800.00
Name: (AAPL, 2016-10-03), dtype: float64

In [59]:
stocks.loc[('AAPL', '2016-10-03'), 'Close']

112.52

In [64]:
stocks.loc[(['AAPL', 'MSFT'], '2016-10-03'), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500

In [65]:
stocks.loc[(['AAPL', 'MSFT'], '2016-10-03'), 'Close']

Symbol  Date
AAPL    2016-10-03    112.52
MSFT    2016-10-03     57.42
Name: Close, dtype: float64

In [67]:
stocks.loc[('AAPL', ['2016-10-03', '2016-10-04']), 'Close']

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
Name: Close, dtype: float64

In [69]:
stocks.loc[(slice(None), ['2016-10-03', '2016-10-04']), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900

In [71]:
volume = pd.read_csv('./data/smallstocks.csv', usecols = [0,2,3], 
                    index_col = ['Symbol', 'Date', 'Volume'])
volume

Empty DataFrame
Columns: []
Index: [(CSCO, 2016-10-03, 14070500), (AAPL, 2016-10-03, 21701800), (MSFT, 2016-10-03, 19189500), (AAPL, 2016-10-04, 29736800), (MSFT, 2016-10-04, 20085900), (CSCO, 2016-10-04, 18460400), (MSFT, 2016-10-05, 16726400), (CSCO, 2016-10-05, 11808600), (AAPL, 2016-10-05, 21453100)]